tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
brew "azure-cli"
brew "direnv"
brew "git"
brew "git-lfs"
brew "hub"
brew "jq"
brew "nvm"
brew "rbenv"
cask "dotnet"

if (/darwin/ =~ RUBY_PLATFORM) != nil 
  brew "mas"
  cask "font-fira-code"
  cask "font-fira-mono-for-powerline"
  cask "visual-studio-code-insiders"
  cask "notion"
  cask "google-chrome"
  cask "slack"
  cask "microsoft-teams"
  cask "zoomus"

  mas "Speedtest", id: 1153157709
  mas "Ulysses", id: 1225570693
  mas "Pixelmator Pro", id: 1289583905
end